<template>
    <div>
        <div>
            <Collapse accordion v-model="value3" class="big_mianban">
                <!-- 马超 -->
                <Panel name="1">
                    <span>马超</span>
                    <div slot="content">
                        马超（176年－222年），字孟起，扶风茂陵人（今陕西兴平），伏波将军马援之后，卫尉马腾之子。东汉末年军阀，三国蜀汉名将，少年成名，曹操曾多次征召马超入京为官，但都被马超拒绝。而后马腾入京被封为卫尉，马超就统领了马腾的部队。
                        建安十六年（211年），曹操治兵关中，马超联合关中诸侯韩遂等抵抗曹操，曾一度对曹操造成了极大的威胁，但被曹操用离间计击败退走，而后聚拢部队再次攻取陇上诸郡，失败后依附汉中张鲁。
                        刘备攻打刘璋时，马超投降刘备，与刘备军合围成都，汉中之战后联名上书尊刘备为汉中王。蜀汉建立后，马超官至骠骑将军、斄乡侯。章武二年（222年）马超病死，终年47岁，刘禅时期被追谥为威侯。有一女嫁于安平王刘理。有剑术“出手法”流传后世。
                        <Collapse accordion v-model="value4" >
                            <Panel name="1-1">
                                <span >辅刘七载</span>
                                <p slot="content">建安二十年（215年），正旦（正月初一）时候，马超妾董氏的弟弟董种来向马超恭贺新年，马超捶胸吐血而说：“家门百口余人，全部被杀害，如今我们两个还有什么好相庆祝的？” [45]  到了夏季，刘备听说马超要来投，高兴的说道：“益州可以拿下了！”于是派人去迎接马超，且偷偷把自己的一支军队给马超，让马超率兵合围成都。马超率领兵马径直到成都，屯兵于城北，城中所有人都因为马超威名而惊恐，不到十天的时间，成都军民就崩溃了，刘璋随即开城投降。刘备平定西川后，迁升马超为平西将军，并命他督临沮</p>
                            </Panel>
                            <Panel name="1-2">
                                <span>人物评价</span>
                                <p slot="content">曹操：诸将见军败，不知公所在，皆惶惧。至见乃悲喜，或流涕。公大笑曰：“今日几为小贼所困乎。” </p>
                            </Panel>
                        </Collapse>
                    </div>
                </Panel>
                <!-- 杨修 -->
                <Panel name="2">
                    <span>杨修</span>
                    <p slot="content">杨修（175年—219年），字德祖，东汉文学家，司隶部弘农郡华阴（今陕西华阴）人，太尉杨彪之子，母为袁氏（司徒袁安曾孙女）.杨修为人恭敬，学问渊博，极聪慧，建安年间（196—220）被推选为孝廉，不久改任郎中，后改人丞相府仓曹属主簿 [3]  。史载，“是时，军国多事，修总知外内，事皆称意”。</p>
                </Panel>
                <!-- 法正  -->
                <Panel name="3">
                    <span>法正 </span>
                    <p slot="content">法正（176年－220年），字孝直。扶风郿（今陕西省眉县小法仪镇）人。东汉末年刘备帐下谋士，名士法真之孙。
                        原为刘璋部下，刘备围成都时劝说刘璋投降，而后又与刘备进取汉中，献计将曹操大将夏侯渊斩首。法正善奇谋，深受刘备信任和敬重。
                        建安二十四年（219年），刘备进位汉中王，封法正为尚书令、护军将军。次年，法正去世，终年四十五岁。法正之死令刘备十分感伤，连哭数日。被追谥为翼侯，是刘备时代唯一一位有谥号的大臣。法正善于奇谋，被陈寿称赞为可比曹操帐下的程昱和郭嘉。《全三国文》辑录有其文一篇
                    </p>
                </Panel>
                <!-- 杜预 -->
                <Panel name="4">
                    <span>杜预</span>
                    <div slot="content">
                        杜预（222年－285年），字元凯，京兆杜陵（今陕西西安东南）人，西晋时期著名的政治家、军事家和学者，灭吴统一战争的统帅之一。历任曹魏尚书郎、西晋河南尹、安西军司、秦州刺史、度支尚书、镇南大将军，官至司隶校尉。太康五年闰十二月（285年初），杜预逝世，终年六十三岁，追赠征南大将军、开府仪同三司，谥号成侯。灭吴功成之后，耽思经籍，博学多通，多有建树，被誉为“杜武库”。著有《春秋左氏经传集解》及《春秋释例》等。他是明朝之前唯一一个同时进入文庙和武庙之人。
                        <Collapse accordion v-model="value4" >
                            <Panel name="1-1">
                                <span >出生仕宦</span>
                                <p slot="content">杜预出身在曹魏政府的高级官僚家庭。祖父杜畿是三国时期曹魏的名臣，担任河东太守十六年，因为与荀彧、耿纪关系密切，因此不受曹操的信任，直到曹丕即魏王位，才获封关内侯，入朝担任尚书。曹丕代汉称帝后，杜畿进封为亭侯。以尚书之职代理司隶校尉，但早在黄初二年（221年），与杜畿同样是荀彧荐举的司马懿就已经是尚书右仆射了。直到黄初三年（222年）的十月，曹丕征吴，杜畿才升任尚书仆射，杜畿留守洛阳。四年九月曹丕再次去许昌时，让杜畿留守，并且受诏制造龙船，尚书仆射是百官师长做这种事本身就是不应该，结果杜畿在孟津试船时遇难，曹丕非常悲伤，追赠他为太仆，谥号戴侯。</p>
                            </Panel>
                            <Panel name="1-2">
                                <span>三陈平吴</span>
                                <p slot="content">当时，全国尚未统一，孙吴政权仍控制着长江中下游以南的地区。不过，孙吴的国力远比西晋要弱，再加上政局动荡，很难同西晋抗衡。司马炎登位以后一直想发动灭吴战争，但西晋朝廷内部的意见并不一致。除羊祜、张华等少数大臣支持司马炎的想法外，大多数人态度暧昧。朝廷中的一些实力派人物，如贾充、荀勖等则持有不同见解，以致错过了一些灭掉孙吴的极好的战机。咸宁四年（278年）春季，荆州前线的晋军主帅羊祜突然病重，一直优柔寡断的司马炎有些后悔，想让羊祜带病出征，但羊祜很快去世了。临终前，羊祜向司马炎举荐杜预接替自己，认为他完全可以担此重任。羊祜举荐杜预，一方面是因为在朝廷内部的争论中，杜预始终站在羊祜一边，积极支持灭吴战争；另一方则是因为杜预具有卓越的军事才能。杜预驻守的襄阳是西晋南部边境荆州的首府。当时，西晋和孙吴各有一个荆州，形成南北对峙的局面。战争一开始，杜预的首要任务是夺取孙吴的荆州。</p>
                            </Panel>
                        </Collapse>
                    </div>
                </Panel>
                <!-- 段业  -->
                <Panel name="5">
                    <span>段业 </span>
                    <p slot="content">前秦苻坚时，段业在大将吕光部下为将。前秦建元十八年(382)，苻坚发兵7．5万人，命吕光西征龟兹(今新疆库车)等西域诸国，段业随同吕光进军西域。前秦建元二十一年(385)八月，苻坚被姚苌杀死。同年九月，段业随吕光从西域东还，在途中受到凉州刺史梁熙的阻击。吕光打败梁熙，占据了姑臧(今甘肃武威)城。闻听苻坚已死，吕光在姑臧自称凉州牧，建立了后凉政权，派段业担任建康(在今甘肃高台西北)太守。后秦皇初三年(397)，吕光派弟吕延率军攻西秦(都金城，即今甘肃兰州)。兵败，吕延被杀。吕光归罪于部将、卢水(即今黑水)胡沮渠(匈奴官名，以官为姓氏)罗仇，杀了罗仇。罗仇的侄儿蒙逊，趁一万多部众为罗仇送葬之机，号召胡人起兵反抗。同时起兵的有沮渠男成率领的数千胡人。诸胡首领推段业为盟主，段业遂进兵占据了张掖地区，于399年自称凉王，史称“北凉”，年号“天玺”。
                    </p>
                </Panel>
                <!-- 寇谦之  -->
                <Panel name="6">
                    <span>寇谦之 </span>
                    <p slot="content">寇谦之（365-448），名谦，字辅真 [1]  ，冯翊万年（今陕西省西安市）人。北朝时期道教代表人物与领袖，新天师道（北天师道）的改革者和代表人物 [2]  ，南雍州刺史寇赞之弟。祖籍上谷昌平，早好仙道，有绝俗之心。少奉正一盟威道，后从成公兴修道于嵩山。自称太上老君授予“天师”之位，又称老子玄孙李普文下降传授《录图真经》，“去除三张（张陵、张衡、张鲁）伪法”。始光元年（424年），献道于太武帝，倡导道教改革，制订乐章，诵戒新法，得到太武帝和宰臣崔浩鼎力支持，亲赴道场受箓，修建新天师道场。
                    </p>
                </Panel>
                <!-- 马钧  -->
                <Panel name="7">
                    <span>马钧 </span>
                    <p slot="content">出身贫寒。他是中国古代的机械大师。他的不少发明创造对当时生产力的发展起了相当大的作用。因为他在传动机械方面有很深的造诣，所以当时人们对他的评价很高，称他为“天下之名巧”。马钧从小口吃，不善言谈。但是他很喜欢思索，善于动脑，同时注重实践，勤于动手，尤其喜欢钻研机械方面的问题。马钧早年生活比较贫困，长时间住在乡间，比较关心生产工具的改革，并且作出了突出贡献。马钧少年游乐，未认识到自己的才华。当博士时，生活贫困，于是改进绫机，并因此而出名。后来，在魏朝担任给事中，同时研制机械。他虽然一生不大得志，但刻苦钻研，设计制造出多种机械。魏明帝时，见当时织机五十条经线者有五十蹑（脚踏操纵板），六十条经线者六十蹑，便将织机一律改为十二蹑，大大提高了功效。在洛阳时，又发明了排灌水车，名叫“翻车”，它利用人力可以将水由低处提到高处。他还研究制造出指南车，改进了诸葛亮的连弩，改进了攻城用的发石车。他制造的“水转百戏”以水为动力，以机械木轮为传动装置，使木偶可以自动表演，构思十分巧妙。
                    </p>
                </Panel>
            </Collapse>
        </div>
    </div>
</template>

<script>
export default {
    name:"People",
    data(){
        return {
            value3: '1',
            value4: '1-1'
        }
    }
}
</script>

<style scoped>
.big_mianban{
    width:80%;
    margin:0 auto;
    background:#17233d;
}
.big_mianban span{
    color:#19be6b;
}

</style>
